## 5. Data Checking

In [17]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col = 'number')
df

         name  school    language  gpa
number
1        Park  GATech      Python  3.4
2         Lee  GATech        Java  3.2
3         Kim  GATech           C  3.8
4       Rishi  GATech        Ruby  4.0
5        Chen  GATech  TypeScript  3.5

## DataFrame Checking

In [18]:
df.describe()

            gpa
count  5.000000
mean   3.580000
std    0.319374
min    3.200000
25%    3.400000
50%    3.500000
75%    3.800000
max    4.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 1 to 5
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      5 non-null      object
 1   school    5 non-null      object
 2   language  5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes

In [19]:
df.head() # first 5 rows

         name  school    language  gpa
number
1        Park  GATech      Python  3.4
2         Lee  GATech        Java  3.2
3         Kim  GATech           C  3.8
4       Rishi  GATech        Ruby  4.0
5        Chen  GATech  TypeScript  3.5

In [20]:
df.head(7) # first 7 rows

         name  school    language  gpa
number
1        Park  GATech      Python  3.4
2         Lee  GATech        Java  3.2
3         Kim  GATech           C  3.8
4       Rishi  GATech        Ruby  4.0
5        Chen  GATech  TypeScript  3.5

In [22]:
df.tail() # last 5 rows

         name  school    language  gpa
number
1        Park  GATech      Python  3.4
2         Lee  GATech        Java  3.2
3         Kim  GATech           C  3.8
4       Rishi  GATech        Ruby  4.0
5        Chen  GATech  TypeScript  3.5

In [21]:
df.tail(3) # last 3 rows

         name  school    language  gpa
number
3         Kim  GATech           C  3.8
4       Rishi  GATech        Ruby  4.0
5        Chen  GATech  TypeScript  3.5

In [23]:
df.values

array([['Park', 'GATech', 'Python', 3.4],
       ['Lee', 'GATech', 'Java', 3.2],
       ['Kim', 'GATech', 'C', 3.8],
       ['Rishi', 'GATech', 'Ruby', 4.0],
       ['Chen', 'GATech', 'TypeScript', 3.5]], dtype=object)

In [24]:
df.index

Int64Index([1, 2, 3, 4, 5], dtype='int64', name='number')

In [25]:
df.columns

Index(['name', 'school', 'language', 'gpa'], dtype='object')

In [26]:
df.shape

(5, 4)

## Series Checking

In [27]:
df['language'].describe()

count        5
unique       5
top       Ruby
freq         1
Name: language, dtype: object

In [ ]:
# df.['something'].max() -> max value
# df.['something'].min() -> min value
# df.['something'].nlargest(4) -> 4 large values
# df.['something'].mean() -> mean value
# df.['something'].sum() -> sum
# df.['something'].count() -> count
# df.['something'].unique() -> unique values
# df.['something'].nunique() -> number of unique values